[{
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:%E0%B8%AD%E0%B8%99%E0%B8%B8%E0%B8%AA%E0%B8%B2%E0%B8%A7%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B9%8C%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B8%AD%E0%B8%B9%E0%B9%88%E0%B8%97%E0%B8%AD%E0%B8%87342.jpg",
    "name": "Somdet Phra Chao Uthong",
    "reign": "1350-1369",
    "doing": "He was known as Prince U Thong (meaning \"Golden Cradle\") before he ascended to the throne in 1350. He was thought to have been a descendant of Mangrai.Ramathibodi I established four Great Officers of State. These were the Ministry of the Interior (Wieng), the Ministry of the Treasury (Klang), the Ministry for the King's Household (Wang), and the Ministry of Agriculture (Na). He also codified the T'ai laws. Finally, he formed an alliance with the Ming Dynasty.He established his own capital in the new city of Ayutthaya. King Ramathabodi's reign included Korat, Chantaburi, Tavoy, Tenasserim, and large parts of Malaya.According to a better-known source, a seventeenth-century account by Dutchman Jeremias Van Vliet, a Renowned Legend stated that Ramatibodi was an ethnic Chinese, having sailed doingwn from China. After succeeding in trade, he became influential enough to rule the city of Phetchaburi, a coastal town of the Gulf of Thailand, before travelling up to Ayutthaya.In 1352 he laid siege to Yasodharapura. He was successful the following year and placed one of his sons on the throne. However, they were only able to keep the throne until 1357, when the Khmers were able to regain it.King Ramathibodi's death sparked a conflict over succession. Initially, his son King Ramesuan became ruler of Ayutthaya, but King Ramesuan later abdicated in favor of King Ramathibodi's brother-in-law, King Borommaracha I. This rivalry for the throne may have been peaceful or it may have been bloody."
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
    "name": "Somdet Phra Ramesuan",
    "reign": "1369-1370",
    "doing": "When King Ramathibodi ascended to the throne of Ayuthaya, he sent King Ramesuan to reign in Lavo. Upon King Ramathibodi's death in 1369, King Ramesuan traveled to Ayutthaya to assume the throne, but held it for less than a year before being deposed by his uncle, King Borommaracha I, the ruler of Suphanburi. Sources differ over the nature of their conflict; official chronicles state that the older Boromaracha ruled with the willing consent of his nephew, while Jeremias van Vliet's Short History of Thailand indicated that Boromaracha's ascension came only after a bloody conflict bordering on civil war."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:KingNU.jpg",
    "name": "Somdet Phra Naresuan the Great",
    "reign": "29 July 1590 - 7 April 1605",
    "doing": "Naresuan is one of Thailand's most revered monarchs as he is known for his campaigns to free Ayutthaya from the vassalage of the Taungoo Empire. During his reign, numerous wars were fought against Taungoo Burma. Naresuan also welcomed the Dutch."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Ekatotsarotwpamok06.jpg",
    "name": "Somdet Phra Ekathotsarot",
    "reign": "25 April 1605 - 1620 ",
    "doing": " His reign was mostly peaceful as Siam was then a powerful state through the conquests of Naresuan. It was also during his reign that foreigners of various origin began to fill the mercenary corps. In particular, the king had a regiment of professional Japanese guards under the command of Yamada Nagamasa.During Ekathotsarot's reign, the English first came to Siam in 1612."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Narai.JPG",
    "name": "Somdet Phra Narai the Great",
    "reign": "26 October 1656 - 11 July 1688",
    "doing": "His reign was the most prosperous during the Ayutthaya period and saw the great commercial and diplomatic activities with foreign nations including the Middle East and the West. During the later years of his reign, Narai gave his favorite – the Greek adventurer Constantine Phaulkon – so much power that Phaulkon technically became the chancellor of the state. "
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B8%9A%E0%B8%A3%E0%B8%A1%E0%B8%A3%E0%B8%B9%E0%B8%9B_%E0%B8%AA%E0%B8%A1%E0%B9%80%E0%B8%94%E0%B9%87%E0%B8%88%E0%B8%9E%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%88%E0%B9%89%E0%B8%B2%E0%B9%80%E0%B8%AA%E0%B8%B7%E0%B8%AD_%E0%B8%A7%E0%B8%B1%E0%B8%94%E0%B9%84%E0%B8%97%E0%B8%A3.jpg",
    "name": "Somdet Phra Suriyenthrathibodi",
    "reign": "1703 - 1709",
    "doing": "Suriyenthrathibodi was also known by the noble title he held before ascending the throne, Luang Sorasak (Thai: หลวงสรศักดิ์). He was the eldest son of the founder of the Ban Phlu Luang dynasty, Phetracha."
  }
]
