[{
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Buddha_Yodfa_Chulaloke_portrait.jpg",
    "name": "Phrabat Somdet Phra Ramathibodi Sri Sinthra Maha Chakri Boromanat Phra Phutthayotfa Chulalok the Great",
    "reign": "6 April 1782 - 7 September 1809",
    "doing": "was the founder of Rattanakosin Kingdom and the first monarch of the reigning Chakri dynasty of Siam (now Thailand). His full title in Thai is Phra Bat Somdet Phra Paramoruracha Mahachakkriborommanat Phra Phutthayotfa Chulalok (Thai: พระบาทสมเด็จพระปรโมรุราชามหาจักรีบรมนารถ พระพุทธยอดฟ้าจุฬาโลก). He ascended the throne in 1782, after defeating a rebellion which had deposed King Taksin of Thonburi. He was also celebrated as the founder of Rattanakosin (now Bangkok) as the new capital of the reunited kingdom."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Buddha_Loetla_Nabhalai_portrait.jpg",
    "name": "Phrabat Somdet Phra Ramathibodi Sri Sinthra Maha Itsarasunthon Phra Phutthaloetla Naphalai",
    "reign": "7 September 1809 - 21 July 1824",
    "doing": "ruling from 1809 to 1824. In 1809, Itsarasunthon succeeded his father Rama I, the founder of Chakri dynasty, as Loetlanaphalai the King of Siam. His reign was largely peaceful, devoid of major conflicts. His reign was known as the \"Golden Age of Rattanakosin Literature\" as Loetlanaphalai was patron to a number of poets in his court and the King himself was a renowned poet and artist. The most notable poet in his employ was the illustrious Sunthorn Phu, the author of Phra Aphai Mani."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Nangklao_portrait.jpg",
    "name": "Phrabat Somdet Phra Ramathibodi Sri Sinthra Maha Jessadabodindra Phra Nang Klao Chao Yu Hua",
    "reign": "21 July 1824 - 2 April 1851",
    "doing": "His succession was unusual according to the traditions  because Nangklao was a son of a concubine rather than that of a queen. His accession was perceived by foreign observers as having usurped the prior claim of Prince Mongkut, who was a legitimate son of Rama II born to a queen, Srisuriyendra. Under the old concept of Thai monarchy, however, a proper king must emulate Maha Sammata in that he must be \"elected by the people.\" Ironically, Prince Mongkut may have later contributed to this misconception, when he feared that his own accession might be perceived by foreign observers as a usurpation."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Rama4_portrait_(cropped).jpg",
    "name": "Phrabat Somdet Phra Paramenthra Maha Mongkut Phra Chom Klao Chao Yu Hua",
    "reign": "2 April 1851 - 1 October 1868",
    "doing": "Outside Thailand, he is best known as the King in the 1951 musical and 1956 film The King and I, based on the 1946 film Anna and the King of Siam – in turn based on a 1944 novel by an American missionary about Anna Leonowens' years at his court, from 1862 to 1867. During his reign, the pressure of Western expansionism was felt for the first time in Siam. Mongkut embraced Western innovations and initiated the modernization of his country, both in technology and culture—earning him the nickname \"The Father of Science and Technology\" in Siam."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:King_Chulalongkorn.jpg",
    "name": "Phrabat Somdet Phra Paraminthra Maha Chulalongkorn Phra Chulachomklao Chao Yu Hua the Great",
    "reign": "1 October 1868 - 23 October 1910",
    "doing": "He was known to the Siamese of his time as Phra Phuttha Chao Luang (พระพุทธเจ้าหลวง, the Royal Buddha). His reign was characterized by the modernization of Siam, governmental and social reforms, and territorial concessions to the British and French. As Siam was threatened by Western expansionism, Chulalongkorn, through his policies and acts, managed to save Siam from colonisation. All his reforms were dedicated to ensuring Siam's survival in the face of Western colonialism, so that Chulalongkorn earned the epithet Phra Piya Maharat (พระปิยมหาราช, the Great Beloved King)."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:King_Vajiravudh.jpg",
    "name": "Phrabat Somdet Phra Paramenthra Maha Vajiravudh Phra Mongkut Klao Chao Yu Hua",
    "reign": "23 October 1910 - 26 November 1925",
    "doing": " ruling from 1910 until his death. King Vajiravudh is known for his efforts to create and promote Siamese nationalism. His reign was characterized by Siam's movement further towards democracy and minimal participation in World War I."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Prajadhipok_portrait.jpg",
    "name": "Phrabat Somdet Phra Paraminthra Maha Prajadhipok Phra Pok Klao Chao Yu Hua",
    "reign": "26 November 1925 - 2 March 1935",
    "doing": " He was the last absolute monarch and the first constitutional monarch of the country. His reign was a turbulent time for Siam due to political and social changes during the Revolution of 1932. He is to date the only Siamese monarch of the Chakri Dynasty to abdicate."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:King_Ananda_Mahidol_portrait_photograph.jpg",
    "name": "Phrabat Somdet Phra Paramenthra Maha Ananda Mahidol Phra Atthama Ramathibodin",
    "reign": "2 March 1935 - 9 June 1946",
    "doing": " At the time he was recognised as king by the National Assembly in March 1935, he was a nine-year-old boy living in Switzerland. He returned to Thailand in December 1945, but six months later in June 1946, he was found shot dead in his bed. Although at first thought to have been an accident, his death was ruled a murder by medical examiners, and three royal pages were later executed following very irregular trials. The mysterious circumstances surrounding his death have been the subject of much controversy."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Portrait_painting_of_King_Bhumibol_Adulyadej.jpg",
    "name": "Phrabat Somdet Phra Paraminthra Maha Bhumibol Adulyadej Siamindradhiraj Borommanathbobitra the Great",
    "reign": "9 June 1946	- 13 October 2016",
    "doing": "Reigning since 9 June 1946 he was, at the time of his death, the world's longest-reigning head of state,the longest-reigning monarch in Thai history and the longest-reigning monarch having reigned only as an adult, reigning for 70 years, 126 days.During his reign, he was served by a total of 30 prime ministers beginning with Pridi Banomyong and ending with Prayut Chan-o-cha.His successor, Vajiralongkorn, does not share his popularity, leading to concerns that the Thai monarchy will lose prestige and influence under the latter's reign."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Vajiralongkorn_(tight_crop).jpg",
    "name": "Somdet Phra Chao Yu Hua Maha Vajiralongkorn Bodindradebayavarangkun",
    "reign": "13 October 2016 - Present",
    "doing": "He is the only son of King Bhumibol Adulyadej and Queen Sirikit. In 1972, at the age of 20, he was made crown prince by his father. After his father's death on 13 October 2016, he was expected to succeed to the throne of Thailand but asked for time to mourn before taking the throne."
  }
]
