[{
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:%E0%B8%9E%E0%B9%88%E0%B8%AD%E0%B8%82%E0%B8%B8%E0%B8%99%E0%B8%A8%E0%B8%A3%E0%B8%B5%E0%B8%AD%E0%B8%B4%E0%B8%99%E0%B8%97%E0%B8%A3%E0%B8%B2%E0%B8%97%E0%B8%B4%E0%B8%95%E0%B8%A2%E0%B9%8C.jpg",
    "name": "Pho Khun Si Inthrathit (Bang Klang Haw)",
    "reign": "1238-1270",
    "do": "He is credited as the founder of the Phra Ruang Dynasty, itself credited as the first historical Siamese dynasty, having a double claim to this title: for being cradled precisely in the region designated by foreigners as \"Siam\" (Khmer: Syāiņ; Chinese: Sien, etc.), and for being the dynasty which freed the Thai principalities from the Cambodian yoke."
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
    "name": "Pho Khun Ban Mueang",
    "reign": "1270-1271",
    "do": "was a king of Sukhothai, an ancient kingdom in Thailand. He was from the House of Phra Ruang."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Ramkhamhaeng_the_Great.jpg",
    "name": "Pho Khun Ram Khamhaeng the Great (Pho Khun Ram Racha)",
    "reign": "1279-1298",
    "do": "was the third king of the Phra Ruang dynasty, ruling the Sukhothai Kingdom (a forerunner of the modern kingdom of Thailand) from 1279–1298, during its most prosperous era. He is credited with the creation of the Thai alphabet and the firm establishment of Theravada Buddhism as the state religion of the kingdom.Recent scholarship has cast doubt on his role, however, noting that much of the information relating to his rule may have been fabricated in the 19th century in order to legitimize the Siamese state in the face of colonial threats."
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
    "name": "Phaya Loethai",
    "reign": "1298-1323",
    "do": "He was preceded by his father Pho Khun Ramkhamhaeng until the throne was usurped by his cousin Phaya Nguanamthom.
    After the death of Ramkhamhaeng,
    the Sukhothai tributaries broke away.Ramkhamhaeng was succeeded by his son Loe Thai.The vassal kingdoms,
    first Uttaradit in the north,
    then soon after the Laotian kingdoms of Luang Prabang and Vientiane(Wiangchan),
    liberated themselves from their overlord.In 1319,
    the Martaban to the west broke away,
    and in 1321 Phrae Tak,
    one of the oldest towns under the control of Sukhothai,
    under its control.To the south the powerful city of Suphanburi also broke free early in the reign of Loe Thai.
    "
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
    "name": "Phaya Nguanamthom",
    "reign": "1323-1347",
    "do": "He was from the House of Phra Ruang.Preceded by Loe Thai, he possibly ascended the throne of Sukhothai in 1866 BE (1323/24 CE).He reigned until his death, which possibly took place in 1890 BE (1347/48 CE).Upon his death, he was succeeded by Mahathammaracha I (Lue Thai)."
  },
  {
    "image": "https://en.wikipedia.org/wiki/List_of_monarchs_of_Thailand#/media/File:Mahathammaracha_I.JPG",
    "name": "Phaya Lithai",
    "reign": "1347-1368",
    "do": "Lithai was the son of Lerthai, also known as Loethai or LeLue Thai, and the grandson of Ramkhamhaeng. The exact chronology of Lithai's rise to the throne is unclear. Popular tradition names him as the fourth king of Sukhothai, but dynastic records seem to indicate that at least one other king (Nguanamthom) ruled between Lithai and his father, as well as the regent Phaya Sai Songkhram who ruled during Lerthai's absence following the death of Ram Khamhaeng the Great.
    Lithai served as uparat during his father 's reign from the city of Srisatchanalai, an important urban center of the early Sukhothai kingdom.
    Lithai wrote the Tri - Bhumi Phra Ruang('Three worlds by Phra Ruang', Phra Ruang being the dynastic name of Lithai 's linneage), a religious text describing the various world of Buddhist cosmology, and the way in which karma consigns living beings to one world or another. The Ten Virtues of a sovereign were set down as guiding principles for Thai monarchs. The Traiphuum would go on to serve as an important political document, being re-interpreted in response to changes in the domestic and international political scene."
    },
    {
      "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
      "name": "Phaya Luethai",
      "reign": "1368-1399",
      "do": "was a king of the Sukhothai Kingdom."
    },
    {
      "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
      "name": "Phaya Saileuthai",
      "reign": "1400-1419",
      "do": "was a king of the Sukhothai Kingdom."
    },
    {
      "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/No_picture_Thai_monarchs.svg",
      "name": "Phaya Borommapan",
      "reign": "1419-1438",
      "do": "n 1419, after the death of Sai Lue Thai, his sons Phaya Ram and Phaya Ban Meuang fought for the throne. Intharacha of Ayutthaya Kingdom intervened and further divided the kingdom between the two. Ban Mueang was installed as a vassal king, owing allegiance to Ayutthaya. His residence was in Phitsanulok, though the kingdom was still referred to as \"Sukhothai\".In 1430, he moved his residence back to the old capital.When Mahathammaracha IV died in 1438, King Borommaracha II of Ayutthaya installed his son Ramesuan (the future king Borommatrailokkanat of Ayutthaya) as viceroy of Sukhothai, thus marking the end of Sukhothai as a separate kingdom."
    }
  ]
