[{
    "image": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Southeast_Asian_history_-_13th_century.png",
    "name": "Sukhothai Kingdom",
    "reign": "1238 - 1438",
    "doing": "Thai city-states gradually became independent of the weakened Khmer Empire. It is said that Sukhothai Kingdom was established as a strong sovereign kingdom by Sri Indraditya in 1238. A political feature which \"classic\" Thai historians call \"father governs children\" existed at this time. Everybody could bring their problems to the king directly, as there was a bell in front of the palace for this purpose. The city briefly dominated the area under King Ram Khamhaeng, who tradition and legend states established the Thai alphabet, but after his death in 1365, Sukhothai fell into decline and became subject to another emerging Thai state, the Ayutthaya Kingdom in the lower Chao Phraya area.

    Another Thai state that coexisted with Sukhothai was the eastern state of Lan Na centred in Chiang Mai.King Mangrai was its founder.This city - state emerged in the same period as Sukhothai.Evidently Lan Na became closely allied with Sukhothai.After the Ayutthaya Kingdom had emerged and expanded its influence from the Chao Phraya valley,
    Sukhothai was
    finally subdued.Fierce battles between Lan Na and Ayutthaya also constantly took place and Chiang Mai was eventually subjugated,
    becoming Ayutthaya 's vassal.

    Lan Na 's independent history ended in 1558, when it finally fell to the Burmese. It was dominated by Burma until the late-18th century. Local leaders then rose up against the Burmese with the help of the rising Thai kingdom of Thonburi of King Taksin. The \"Northern City-States\" then became vassals of the lower Thai kingdoms of Thonburi and Bangkok. In the early 20th century they were annexed and became part of modern Siam, the country that is now called \"Thailand\"."
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/2/28/Southeast_Asian_history_-_Around_1540.png",
    "name": "Ayutthaya period",
    "reign": "1351 - 1767",
    "doing": "The city of Ayutthaya was on a small island, encircled by three rivers. Due to its defensible location, Ayutthaya quickly became powerful, politically, and economically. Ayutthaya's name is derived from Ayodhya, an Indian holy city.

    The first ruler of the Kingdom of Ayutthaya,
    King Uthong(r .1351 - 1369),
    made two important contributions to Thai history: the establishment and promotion of Theravada Buddhism as the official religion to differentiate his kingdom from the neighbouring Hindu kingdom of Angkor and the compilation of the Dharmaśāstra,
    a legal code based on Hindu sources and traditional Thai custom.The Dharmaśāstra remained a tool of Thai law until late in the 19 th century.

    In 1511 Duke Afonso de Albuquerque dispatched Duarte Fernandes as an envoy to the Ayutthaya Kingdom,
    known then to Europeans as the \"Kingdom of Siam\". This contact with the West during the 16th century led to a period of economic growth as lucrative trade routes were established. Ayutthaya became one of the most prosperous cities in Southeast Asia. According to George Modelski, Ayutthaya is estimated to have been the largest city in the world in 1700 CE, with a population around one million. Trade flourished, with the Dutch and Portuguese among the most active foreigners in the kingdom, together with the Chinese and Malayans.

    The Ayutthaya Period is known as golden age of Thai Literature,
    Art and Trade with eastern and western world.In Ayutthaya period was also considered as \"golden age of medicine in Thailand\" due to progress in the field of medicine at that time."
  }, {
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/e6/Carte_royaume_de_Siam.png",
    "name": "Thonburi period",
    "reign": "1768 - 1782",
    "doing": "
    Wat Arun,
    Thonburi
    After more than 400 years of power,
    in 1767,
    the Kingdom of Ayutthaya was brought down by invading Burmese armies,
    its capital burned,
    and the territory split.Despite its complete defeat and occupation by Burma,
    Siam made a rapid recovery.The resistance to Burmese rule was led by a noble of Chinese descent,
    Taksin,
    a capable military leader.Initially based at Chanthaburi in the southeast,
    within a year he had defeated the Burmese occupation army and re - established a Siamese state with its capital at Thonburi on the west bank of the Chao Phraya,
    20 km from the sea.In 1768 he was crowned as King Taksin(now officially known as \"Taksin the Great\")."
    },
    {
      "image": "https://upload.wikimedia.org/wikipedia/commons/f/fc/Territorial_claims.jpg",
      "name": "Rattanakosin period",
      "reign": "1782 - present",
      "doing": "General Chakri succeeded Taksin in 1782 as Rama I, the first king of the Chakri dynasty. In the same year he founded a new capital city across the Chao Phraya River in an area known as Rattanakosin Island. (While settlements on both banks were commonly called Bangkok, both the Burney Treaty of 1826 and the Roberts Treaty of 1833 refer to the capital as the City of Sia-Yut'hia.) In the 1790s, Burma was defeated and driven out of Siam, as it was then called. Lan Na also became free of Burmese occupation, but was reduced to the Kingdom of Chiang Mai. The king of the new dynasty was installed as a tributary ruler of the Chakri monarch."
    }
]
